Revit 2027 API
MacroManager.SetApplicationMacroSecurityOptions Method
 Sets the application macro security options.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void SetApplicationMacroSecurityOptions(
	Application application,
	ApplicationMacroOptions macroOptions
)
Public Shared Sub SetApplicationMacroSecurityOptions (
	application As Application,
	macroOptions As ApplicationMacroOptions
)
public:
static void SetApplicationMacroSecurityOptions(
	Application^ application,
	ApplicationMacroOptions macroOptions
)
static member SetApplicationMacroSecurityOptions :
        application : Application *
        macroOptions : ApplicationMacroOptions -> unit
Parameters
application Application
 The application.
macroOptions ApplicationMacroOptions
 The application macro security options.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
MacroManager Class
Autodesk.Revit.DB.Macros Namespace